app/controllers/users_controller.rb

  def create
    begin
    @user = User.new(user_params)
    if User.find_by_name(params[:name]) != nil
      respond_to do |format|
          format.json { render json: '{"status":"3"}'}
      end
    else
      respond_to do |format|
        if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT 1  [["name", "Marius"]]
INSERT INTO "users" ("name", "public_key", "private_key", "salt_master_key", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Phil"], ["public_key", "456"], ["private_key", "789"], ["salt_master_key", "123"], ["created_at", "2015-05-11 12:29:50.691830"], ["updated_at", "2015-05-11 12:29:50.691830"]]

    def set_user
      if User.find_by_name(params[:id]) != nil then
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT 1  [["name", "Philipp"]]